# GIT - распределение системы контроля версий это система для отслежания истории измении файла, в вашем проекте при помощи распределенности git еще и организовывается командная работа


# Репозиторий - это хранилище вашего кода и истории его изменений

# GitHub - веб-сайт для размещения git-репозиториев в совместной разработке проектов

# команды Git:

# 1. git init - она создает новый локальный репозиторий, в той директории в которой была прописана команда. (Команда вводится один раз в начале)

# 2. git add - команда для добавления изменений в систему отслеживания гита

# 3 git commit -m '<comment>' - команда для сохранения всех изменений в локальном репозитории с коментарием к ним

# 4. git remote add <origin> <url> - это команда для того чтобы связать ваш локальный репо с удаленном репо в гитхабе

# 5. git push <origin> <main> - команда отправки всех ваших изменений на удаленный репо

# ----------------------------
# 1) git init
#         2) git add .
#         3) git commit -m ''
# 4) git remote add origin <url>
#     5) git push origin main 




# git@github.com:GitHuber133/testing.git



